# Работа с удалёнными рипозиториями

1 . Создать окаунт на GitHub
2 . Создать локальный репозиторий
3 . Создать Удалёный репозиторий
4 . Связать Удалёный репозиторий с локальным 

Добавить удалёный репозиторий к проекту

git remote add <имя репозитория> <url-адрес репозитория в сети>
```
``` C#
while(cont < 0)
{
count++;
}
```
Для получения и слияния изменений из удалённого репозитория используется команда `git pull`

Отправить изменения локального репозитория в удалённый `git push`

Отправить изменения локального репозитория в удалённый 'git push'
